clc;
clear;
%tic;
%Заполнили Data данными для текущего датчика по формуле
N = 10000; 
K = 10; %Число интервалов разбиения
Data = [];
x0 = 0.5;
for i = 1:N
    Data(i) = (1 / pi) * acos(cos(i + 100) * x0);
end;
%toc;
%Вычислим математическое ожидание
Mx = mean(Data);
disp(Mx);
%Вычислим дисперсию
Dx = var(Data);
disp(Dx);
%Вычислим Хи-квадрат 
idealXi = chi2inv(0.1, 10); %Идеальное Хи из таблицы для Р = 0.99 с 10 степенями свободы
%Разбиваем на интервалы по встречаемости
V = zeros(1, 10); %число попаданий в каждый из интервалов
step = 1 / K;
Vi = 0;
for j = 0:step:1 - step %Для каждого интервала
for i = 1:N %проходим по всем числам
    if((Data(i) > j) & (Data(i) < j + step))
        V(Vi) = V(Vi) + 1;
    end;
end;
Vi = Vi + 1;

end;
F = [1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000]; %Чего ожидалось бы бы при равной вероятности
v = 10; %Степеней свободы
%x = 1:1:10;
%xi = chi2cdf(x,v);
%Чтобы не получать большие числа, просто уменьшаем их на 1000. От этого
%изменений в сравнении не будет
Y = V .* 0.0001;
F = F .* 0.0001;
%plot(x,xi,'.');
%grid on;
%Сверяем два вектора по Хи-квадрат (чего ожидали и что имеем из выборки)
[p,Q] = chi2test([Y; F]);
disp(Q);

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% for i = 1:N
%     if(Data(i) > 0 & Data(i) < 0.1)
%         V(1) = V(1) + 1;
%     elseif(Data(i) > 0.1 & Data(i) < 0.2)
%         V(2) = V(2) + 1;
%     elseif(Data(i) > 0.2 & Data(i) < 0.3)
%         V(3) = V(3) + 1;
%     elseif(Data(i) > 0.3 & Data(i) < 0.4)
%         V(4) = V(4) + 1;
%     elseif(Data(i) > 0.4 & Data(i) < 0.5)
%         V(5) = V(5) + 1;
%     elseif(Data(i) > 0.5 & Data(i) < 0.6)
%         V(6) = V(6) + 1;
%     elseif(Data(i) > 0.6 & Data(i) < 0.7)
%         V(7) = V(7) + 1;
%     elseif(Data(i) > 0.7 & Data(i) < 0.8)
%         V(8) = V(8) + 1;
%     elseif(Data(i) > 0.8 & Data(i) < 0.9)
%         V(9) = V(9) + 1;
%     elseif(Data(i) > 0.9 & Data(i) < 1.0)
%         V(10) = V(10) + 1;
%     end;
% end; %Костыльный вариант разделения на 10 интервалов по встречаемости - дублирует двойной цикл
%pi = 1 / K; %Вероятности

%sumForXi = 0;
%for i = 1:K-1
%    sumForXi = sumForXi + (V(i) - pi * N) .^ 2;
%end;
%Xi = sumForXi / (pi * N);

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%Построим 2D гистограмму. Тут сколько элементов попадает в каждый интервал
xhist = 0 : 0.1 : 1;
hist(Data, xhist)
%Построим 3D гистограмму.
X = [Data', Data'];
hist3(X,[10 10]);




