G1 = zeros(M, n + 1);           % коэффициенты на основе оценкок МП;
        G2 = zeros(M, n + 1);           % коэффициенты на основе оценкок МАВ;
        for i = 1 : M                       % цикл по классам,
            G1(i, 1 : n)= C \ m_(:, i);
            G1(i, n + 1)= -0.5 * m_(:, i)' / C * m_(:, i);
            G2(i, 1 : n)= C_ \ mN(:, i);
            G2(i, n + 1)= -0.5 * mN(:, i)' / C_ * mN(: ,i);
        end;
        l0_ = log(pw(2) / pw(1));


pe = zeros(2, M);           % Ошибки: 1-я строка для МП, 2-я для МАВ;            
        for i = 1 : M                    % цикл по классам,
            % 4.1. Генерация K образов i-го класса
            xs = repmat(m(:, i), [1, K]) + randncor(n, K, C);
            xs = [xs; ones(1, K)];
            for k = 1 : K                   % цикл по числу испытаний алгоритма распознавания,
                x = xs(:, k);
                u1 = G1 * x + log(pw');         % значение разделяющей функции (по МП);
                [ertqwerq, i1] = max(u1);              % определение максимума;
                pe(1, i) = pe(1, i) + (i ~= i1);% фиксация результата распознавания;
                u2 = G2 * x + log(pw');         % значение разделяющей функции (по МАВ);
                [sdgjhb, i2] = max(u2);              % определение максимума;
                pe(2, i) = pe(2, i) + (i ~= i2);% фиксация результата распознавания;
            end;
        end;
        pe = pe / K;
